Revit 2027 API
CurveLoop.GetRectangularHeight Method
 Returns the width of a curve loop if it is rectangular with respect to the projection plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetRectangularHeight(
	Plane plane
)
Public Function GetRectangularHeight (
	plane As Plane
) As Double
public:
double GetRectangularHeight(
	Plane^ plane
)
member GetRectangularHeight :
        plane : Plane -> float
Parameters
plane Plane
 The plane to which the curves will be projected.
Return Value
Double
 The height.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The curve loop is not rectangular when projected to the input plane.
Remarks
 The height is determined by the V extents of the UV curve created by from the curve loop plane.
See Also
Reference
CurveLoop Class
Autodesk.Revit.DB Namespace